In [39]:
# libraries importation


import pandas as pd
import numpy as np
import os
import sys
import csv
#import arff

In [2]:
# Specify the file path
australian_path = "./datasets/private/1. UCI Repository/Australian/australian.dat"
german_path = "./datasets/private/1. UCI Repository/German/german.data"

In [23]:
# Read a portion of the file to analyze the separator
num_lines_to_read = 10

# Detect the delimiter
with open(australian_path, 'r') as file:
    sample = file.read(num_lines_to_read)
    dialect = csv.Sniffer().sniff(sample)
    delimiter = dialect.delimiter
    
# Print the detected delimiter
print(f"Detected delimiter ({delimiter})")

Detected delimiter ( )

In [3]:
# Specify the delimiter used in the .dat file
delimiter = " "  # Example: tab-separated values

# Specify the list of header names
australian_names = ["A"+str(i) for i in range(1,16)]
german_names = ["Attribute_"+str(i) for i in range(1,21)]
german_names.append('Class')

In [25]:
# Read the .dat file using pandas and set the header names
df_australian = pd.read_csv(australian_path, delimiter=delimiter, names=australian_names)

In [4]:
df_german = pd.read_csv(german_path, delimiter=delimiter, names=german_names)

In [26]:
# Do further operations with the DataFrame
df_australian.head()

   A1     A2     A3  A4  A5  A6     A7  A8  A9  A10  A11  A12  A13   A14  A15
0   1  22.08  11.46   2   4   4  1.585   0   0    0    1    2  100  1213    0
1   0  22.67   7.00   2   8   4  0.165   0   0    0    0    2  160     1    0
2   0  29.58   1.75   1   4   4  1.250   0   0    0    1    2  280     1    0
3   0  21.67  11.50   1   5   3  0.000   1   1   11    1    2    0     1    1
4   1  20.17   8.17   2   6   4  1.960   1   1   14    0    2   60   159    1

In [5]:
df_german.head()

,Attribute_1,Attribute_2,Attribute_3,Attribute_4,Attribute_5,Attribute_6,Attribute_7,Attribute_8,Attribute_9,Attribute_10,...,Attribute_12,Attribute_13,Attribute_14,Attribute_15,Attribute_16,Attribute_17,Attribute_18,Attribute_19,Attribute_20,Class
0,A11,6,A34,A43,1169,A65,A75,4,A93,A101,...,A121,67,A143,A152,2,A173,1,A192,A201,1
1,A12,48,A32,A43,5951,A61,A73,2,A92,A101,...,A121,22,A143,A152,1,A173,1,A191,A201,2
2,A14,12,A34,A46,2096,A61,A74,2,A93,A101,...,A121,49,A143,A152,1,A172,2,A191,A201,1
3,A11,42,A32,A42,7882,A61,A74,2,A93,A103,...,A122,45,A143,A153,1,A173,2,A191,A201,1
4,A11,24,A33,A40,4870,A61,A73,3,A93,A101,...,A124,53,A143,A153,2,A173,2,A191,A201,2

In [12]:
[len(df_german[head].unique().tolist()) for head in df_german.columns.to_list()]

[33, 5, 10, 921, 5, 5, 4, 4, 3, 4, 4, 53, 3, 3, 4, 4, 2, 2, 2, 2]

In [6]:
# export data to csv
#df_australian.to_csv(australian_path[:-4]+".csv", index=False)
df_german.to_csv(german_path[:-4]+"csv", index=False)

In [32]:
# Japan

japan_path = "./1. UCI Repository/Japan/crx.data"

# Specify the delimiter used in the .dat file
delimiter = ","  # Example: tab-separated values

# Specify the list of header names
japan_names = ["A"+str(i) for i in range(1,17)]

df_japan = pd.read_csv(japan_path, delimiter=delimiter, names=japan_names)

# Do further operations with the DataFrame
df_japan.to_csv(japan_path[:-4]+".csv", index=False)
df_japan.head()

  A1     A2     A3 A4 A5 A6 A7    A8 A9 A10  A11 A12 A13    A14  A15 A16
0  b  30.83  0.000  u  g  w  v  1.25  t   t    1   f   g  00202    0   +
1  a  58.67  4.460  u  g  q  h  3.04  t   t    6   f   g  00043  560   +
2  a  24.50  0.500  u  g  q  h  1.50  t   f    0   f   g  00280  824   +
3  b  27.83  1.540  u  g  w  v  3.75  t   t    5   t   g  00100    3   +
4  b  20.17  5.625  u  g  w  v  1.71  t   f    0   f   s  00120    0   +

In [50]:
# Polish

# Specify the path of the ARFF file
arff_paths = [
    "./datasets/private/1. UCI Repository/Polish/data/1year.arff",
    "./1. UCI Repository/Polish/data/2year.arff",
    "./1. UCI Repository/Polish/data/3year.arff",
    "./1. UCI Repository/Polish/data/4year.arff",
    "./1. UCI Repository/Polish/data/5year.arff"
]

for path in arff_paths:
    # Load the ARFF file
    with open(path, "r") as file:
        data = arff.load(file)


    # Convert the data to a pandas DataFrame
    polish_names = [a[0] for a in data['attributes']]
    data1 = {col: val for col, val in zip(polish_names, data['data'])} 
    df = pd.DataFrame(data1)

    # Do further operations with the DataFrame

    df.to_csv(path+".csv", index=False)

In [ ]:
methods = [method for method in dir(arff) if callable(getattr(arff, method))]

# Print the list of methods with descriptions
for method in methods:
    print(f"Method: {method}")
    print(help(getattr(arff, method)))
    print("=" * 80)

In [ ]:
# Japan

japan_path = "./1. UCI Repository/Japan/crx.data"

# Specify the delimiter used in the .dat file
delimiter = ","  # Example: tab-separated values

# Specify the list of header names
japan_names = ["A"+str(i) for i in range(1,17)]

df_japan = pd.read_csv(japan_path, delimiter=delimiter, names=japan_names)

# Do further operations with the DataFrame
df_japan.to_csv(japan_path[:-4]+".csv", index=False)
df_japan.head()

In [57]:
# Specify the file path
path = "./1. UCI Repository/Australian/australian.dat.csv"

df = pd.read_csv(australian_path, delimiter=' ', header=0)
df.head(10)

   1  22.08   11.46  2   4  4.1  1.585  0  0.1  0.2  1.1  2.1  100  1213  0.3
0  0  22.67   7.000  2   8    4  0.165  0    0    0    0    2  160     1    0
1  0  29.58   1.750  1   4    4  1.250  0    0    0    1    2  280     1    0
2  0  21.67  11.500  1   5    3  0.000  1    1   11    1    2    0     1    1
3  1  20.17   8.170  2   6    4  1.960  1    1   14    0    2   60   159    1
4  0  15.83   0.585  2   8    8  1.500  1    1    2    0    2  100     1    1
5  1  17.42   6.500  2   3    4  0.125  0    0    0    0    2   60   101    0
6  0  58.67   4.460  2  11    8  3.040  1    1    6    0    2   43   561    1
7  1  27.83   1.000  1   2    8  3.000  0    0    0    0    2  176   538    0
8  0  55.75   7.080  2   4    8  6.750  1    1    3    1    2  100    51    0
9  1  33.50   1.750  2  14    8  4.500  1    1    4    1    2  253   858    1

In [ ]:
# Specify the file path
path = "./1. UCI Repository/German/german.data"

df = pd.read_csv(australian_path)
df.head(10)

# on 12 Aug 2024

In [81]:
# Specify the file path
path = "./datasets/private/3. Kaggle/Loan Default Dataset/Loan_Default.csv"
df = pd.read_csv(path, delimiter=',', header=0)
df.head(10)

,ID,year,loan_limit,Gender,approv_in_adv,loan_type,loan_purpose,Credit_Worthiness,open_credit,business_or_commercial,...,credit_type,Credit_Score,co-applicant_credit_type,age,submission_of_application,LTV,Region,Security_Type,Status,dtir1
0,24890,2019,cf,Sex Not Available,nopre,type1,p1,l1,nopc,nob/c,...,EXP,758,CIB,25-34,to_inst,98.728814,south,direct,1,45.0
1,24891,2019,cf,Male,nopre,type2,p1,l1,nopc,b/c,...,EQUI,552,EXP,55-64,to_inst,NaN,North,direct,1,NaN
2,24892,2019,cf,Male,pre,type1,p1,l1,nopc,nob/c,...,EXP,834,CIB,35-44,to_inst,80.019685,south,direct,0,46.0
3,24893,2019,cf,Male,nopre,type1,p4,l1,nopc,nob/c,...,EXP,587,CIB,45-54,not_inst,69.376900,North,direct,0,42.0
4,24894,2019,cf,Joint,pre,type1,p1,l1,nopc,nob/c,...,CRIF,602,EXP,25-34,not_inst,91.886544,North,direct,0,39.0
5,24895,2019,cf,Joint,pre,type1,p1,l1,nopc,nob/c,...,EXP,864,EXP,35-44,not_inst,70.089286,North,direct,0,40.0
6,24896,2019,cf,Joint,pre,type1,p3,l1,nopc,nob/c,...,EXP,860,EXP,55-64,to_inst,79.109589,North,direct,0,44.0
7,24897,2019,NaN,Female,nopre,type1,p4,l1,nopc,nob/c,...,CIB,863,CIB,55-64,to_inst,86.525974,North,direct,0,42.0
8,24898,2019,cf,Joint,nopre,type1,p3,l1,nopc,nob/c,...,CIB,580,EXP,55-64,to_inst,78.765690,central,direct,0,44.0
9,24899,2019,cf,Sex Not Available,nopre,type3,p3,l1,nopc,nob/c,...,CIB,788,EXP,55-64,to_inst,63.444767,south,direct,0,30.0

In [82]:
df.describe()

,ID,year,loan_amount,rate_of_interest,Interest_rate_spread,Upfront_charges,term,property_value,income,Credit_Score,LTV,Status,dtir1
count,148670.000000,148670.0,1.486700e+05,112231.000000,112031.000000,109028.000000,148629.000000,1.335720e+05,139520.000000,148670.000000,133572.000000,148670.000000,124549.000000
mean,99224.500000,2019.0,3.311177e+05,4.045476,0.441656,3224.996127,335.136582,4.978935e+05,6957.338876,699.789103,72.746457,0.246445,37.732932
std,42917.476598,0.0,1.839093e+05,0.561391,0.513043,3251.121510,58.409084,3.599353e+05,6496.586382,115.875857,39.967603,0.430942,10.545435
min,24890.000000,2019.0,1.650000e+04,0.000000,-3.638000,0.000000,96.000000,8.000000e+03,0.000000,500.000000,0.967478,0.000000,5.000000
25%,62057.250000,2019.0,1.965000e+05,3.625000,0.076000,581.490000,360.000000,2.680000e+05,3720.000000,599.000000,60.474860,0.000000,31.000000
50%,99224.500000,2019.0,2.965000e+05,3.990000,0.390400,2596.450000,360.000000,4.180000e+05,5760.000000,699.000000,75.135870,0.000000,39.000000
75%,136391.750000,2019.0,4.365000e+05,4.375000,0.775400,4812.500000,360.000000,6.280000e+05,8520.000000,800.000000,86.184211,0.000000,45.000000
max,173559.000000,2019.0,3.576500e+06,8.000000,3.357000,60000.000000,360.000000,1.650800e+07,578580.000000,900.000000,7831.250000,1.000000,61.000000

In [83]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148670 entries, 0 to 148669
Data columns (total 34 columns):
 #   Column                     Non-Null Count   Dtype
---  ------                     --------------   -----
 0   ID                         148670 non-null  int64
 1   year                       148670 non-null  int64
 2   loan_limit                 145326 non-null  object
 3   Gender                     148670 non-null  object
 4   approv_in_adv              147762 non-null  object
 5   loan_type                  148670 non-null  object
 6   loan_purpose               148536 non-null  object
 7   Credit_Worthiness          148670 non-null  object
 8   open_credit                148670 non-null  object
 9   business_or_commercial     148670 non-null  object
 10  loan_amount                148670 non-null  int64
 11  rate_of_interest           112231 non-null  float64
 12  Interest_rate_spread       112031 non-null  float64
 13  Upfront_charges            109028 non-null  float64
 14  term                       148629 non-null  float64
 15  Neg_ammortization          148549 non-null  object
 16  interest_only              148670 non-null  object
 17  lump_sum_payment           148670 non-null  object
 18  property_value             133572 non-null  float64
 19  construction_type          148670 non-null  object
 20  occupancy_type             148670 non-null  object
 21  Secured_by                 148670 non-null  object
 22  total_units                148670 non-null  object
 23  income                     139520 non-null  float64
 24  credit_type                148670 non-null  object
 25  Credit_Score               148670 non-null  int64
 26  co-applicant_credit_type   148670 non-null  object
 27  age                        148470 non-null  object
 28  submission_of_application  148470 non-null  object
 29  LTV                        133572 non-null  float64
 30  Region                     148670 non-null  object
 31  Security_Type              148670 non-null  object
 32  Status                     148670 non-null  int64
 33  dtir1                      124549 non-null  float64
dtypes: float64(8), int64(5), object(21)
memory usage: 38.6+ MB

In [84]:

# html
from IPython.core.display import HTML

In [85]:
def multi_table(table_list):
    """Afficher des tableaux isolés conténant des valeurs
    Args :
      table_list : Une liste de dictionnaire

    Retourne :
      Un noeud HTML
    """
    return HTML('<table><tr style="background-color:#2020d1; color: #FFFFFF;">' +  ''.join(['<td>' + table._repr_html_() + '</td>' for table in table_list]) +'</tr></table>')

In [86]:
nunique_df={var:pd.DataFrame(df[var].value_counts())
           for var in df.columns.tolist()}

multi_table([nunique_df[col] for col in df.columns.tolist()])

In [87]:
list(set(df.columns.tolist())- set(['ID','year']))

['Credit_Worthiness',
 'loan_type',
 'Interest_rate_spread',
 'submission_of_application',
 'Security_Type',
 'Status',
 'co-applicant_credit_type',
 'business_or_commercial',
 'credit_type',
 'total_units',
 'Region',
 'LTV',
 'interest_only',
 'age',
 'loan_limit',
 'Credit_Score',
 'loan_purpose',
 'Upfront_charges',
 'approv_in_adv',
 'dtir1',
 'Secured_by',
 'lump_sum_payment',
 'rate_of_interest',
 'Neg_ammortization',
 'property_value',
 'open_credit',
 'occupancy_type',
 'income',
 'term',
 'Gender',
 'construction_type',
 'loan_amount']

In [59]:
df['age'] = df['age'].apply(lambda x: str(x).replace('<','-') if isinstance(x, str) else x)
df['age'] = df['age'].apply(lambda x: str(x).replace('>','+') if isinstance(x, str) else x)

In [26]:
#df['term'].apply(lambda x: str(x).replace(' months',''))

0          36
1          60
2          36
3          36
4          60
         ...
887374     36
887375     36
887376     60
887377     60
887378     36
Name: term, Length: 887379, dtype: object

In [27]:
#df['term']

0          36
1          60
2          36
3          36
4          60
         ...
887374     36
887375     36
887376     60
887377     60
887378     36
Name: term, Length: 887379, dtype: object

In [60]:
nunique_df={var:pd.DataFrame(df[var].value_counts())
           for var in df.columns.tolist()}

multi_table([nunique_df[col] for col in df.columns.tolist()])

In [61]:

#df.to_csv(path,index=False)